# Имеется список базовых нот:
#
# m = ['до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
#
# Вводятся три целых числа в диапазоне от 1 до 7 - номера нот, в одну строчку через пробел.
# Необходимо отобразить указанные ноты в виде строки через пробел,
# но перед нотами до и фа дополнительно ставить символ диеза '#'.
# Реализовать эту программу с использованием тернарного условного оператора (он может использоваться несколько раз).
# Sample Input:
# 1 6 7
# Sample Output:
# #до ля си

m = ['до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
a,b,c = map(int, input().split())
res1 = ('#' + m[a-1] if m[a-1] == 'фа' else '#' + m[a-1]) if m[a-1] == 'до' else m[a-1]
res2 = ('#' + m[b-1] if m[b-1] == 'до' else '#' + m[b-1]) if m[b-1] == 'фа' else m[b-1]
res3 = ('#' + m[c-1] if m[c-1] == 'фа' else '#' + m[c-1]) if m[c-1] == 'до' else m[c-1]
print(f'{res1} {res2} {res3}')
# another solution
print(
    '#' + m[a-1] if m[a-1] in ['до', 'фа'] else m[a-1],
    '#' + m[b-1] if m[b-1] in ['до', 'фа'] else m[b-1],
    '#' + m[c-1] if m[c-1] in ['до', 'фа'] else m[c-1]
)
# another solution
notes = [('#' + m[i-1] if m[i -1] in ['до', 'фа'] else m[i-1]) for i in map(int, input().split())]
print(*notes)