a = [(i, j)
     for i in range(3) if i % 3 == 0
     for j in range(4) if j % 2 == 0
     ]
print(a)  # [(0, 0), (0, 2)]
# Таким образом мы можем реализовать таблицу умножения
b = [f'{i}*{j} = {i * j}'
     for i in range(1, 5)
     for j in range(1, 5)
     ]
print(
    b)  # ['1*1 = 1', '1*2 = 2', '1*3 = 3', '1*4 = 4', '2*1 = 2', '2*2 = 4', '2*3 = 6', '2*4 = 8', '3*1 = 3', '3*2 = 6', '3*3 = 9', '3*4 = 12', '4*1 = 4', '4*2 = 8', '4*3 = 12', '4*4 = 16']
# мы можем преобразовать двухмерный список в одномерный
matrix = [[0, 1, 2, 3],
          [10, 11, 12, 13],
          [20, 21, 22, 23]
          ]
c = [x for row in matrix
     for x in row
     ]
print(c)  # [0, 1, 2, 3, 10, 11, 12, 13, 20, 21, 22, 23]
# а теперь создадим двухмерный список через вложенный генератор
M, N = 3, 4
v = [[i for i in range(M)] for j in range(N)]
print(v)  # [[0, 1, 2], [0, 1, 2], [0, 1, 2], [0, 1, 2]]
# теперь мы переберём двухмерный список и возведём каждый элемент вложеного списка в квадрат
A = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
A = [[x ** 2 for x in row] for row in A]
print(A)  # [[1, 4, 9], [16, 25, 36], [49, 64, 81]]
# А теперь если мы запишем код иначе то получится одномерный список!!!!!!!!!!!!
A = [x ** 2
     for row in A
     for x in row
     ]
print(*A)  # [1, 4, 9, 16, 25, 36, 49, 64, 81]
# Необходимо разложить  на столбцы, у нас получается транспонированая матрица
B = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
B = [[row[i] for row in B] for i in range(len(B[0]))]
print(B) # [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
# Вложеный генератор в цикл
g = [u ** 2 for u in [x + 1 for x in range(5)]]
print(g) # [1, 4, 9, 16, 25]