#Вводится стоимость книги X рублей (например, X = 435.78) - положительное вещественное число с точностью до сотых
# (два знака после запятой). Требуется определить, является ли дробное значение (число после запятой) больше 50.
# На экран вывести True, если больше и False - в противном случае. Задача делается без использования условного оператора.
# Sample input: 456.56
# Sample Output: True

# x = float(input())
# a = (x - int(x))
# x = a * 101
# print(int(x) > 50 or int(x) < 50)
# Или вот такое решение!!!!!!
# print(x * 100 % 100 > 50)

