# Имеется закодированная строка с помощью азбуки Морзе. Коды разделены между собой пробелом.
# Необходимо ее раскодировать, используя азбуку Морзе из предыдущего занятия. Полученное сообщение (строку) вывести на экран.
# Sample Input:
# .-- ... . -...- .-- . .-. -. ---
# Sample Output:
# все верно

d = {'А': '.-', 'М': '--', 'Ш': '----',
     'Б': '-...', 'Н': '-.', 'Щ': '--.-',
     'В': '.--', 'О': '---', 'Ъ': '--.--',
     'Г': '--.', 'П': '.--.', 'Ы': '-.--',
     'Д': '-..', 'Р': '.-.', 'Ь': '-..-',
     'Е': '.', 'Ё': '.',	'С': '...',	'Э': '..-..',
     'Ж': '...-', 'Т': '-', 'Ю': '..--',
     'З': '--..', 'У': '..-', 'Я': '.-.-',
     'И': '..', 'Ф': '..-.,', ' ': '-...-',
     'Й': '.---', 'Х': '....',
     'К': '-.-', 'Ц': '-.-.',
     'Л': '.-..', 'Ч': '---.'}

l = input().upper().split()
c = []
morze = {v:k for k,v in d.items()} # поменяли местами ключи со значениями!!!!
for i in l:
    if i in morze:
        c.append(morze[i].lower())
print(*c, sep='')
# enother solution
s = input().split()
res = [print(k.lower(), end='') for i in s for k, v in d.items() if i == v]
# enother solution
symbol = input().split()
translation = []
for i in symbol:
     for key, value in d.items():
          if i == value:
               translation.append(key.lower())
               break
print(*translation, sep='')