# Имеется список из названий городов:
# cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
# Необходимо записать генератор, который бы используя этот список, выдавал 1 000 000 наименований городов по циклу.
# То есть, дойдя до конца списка, возвращался в начало и повторял перебор. И так, для выдачи миллиона названий.
# Вывести на экран первые 20 наименований городов с помощью генератора в одну строчку через пробел.

def city(x):
    count = 0
    sum_city = 0
    while count != 100:
        count += 1
        gen = (x for x in x)
        for i in range(6):
            print(next(gen), end=' ')
            sum_city += 1
            if sum_city == 20:
                return sum_city


cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
city(cities)

# another solution

def citi(x):
    res = [j for i in range(0, 1000000) for j in x]
    s = res[:20]
    print(*s)


cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
citi(cities)