a = [1, 2, 3, 4]
b = [5, 6, 7, 8, 9, 10]
c = 'Python'

# можно сделать вот такую запись, разбить по кортежам
z1, *z = zip(a, b, c)
# print(z1, z2, z3, z4)
# а можно ещё вот так
print(z1, *z)  # (1, 5, 'P') (2, 6, 'y') (3, 7, 't') (4, 8, 'h')
# распакуем этот кортеж
# for a1, b1, c1 in z:
#     print(a1, b1, c1)

# ещё одна запись

z = zip(a, b, c)
# lz = list(z)
t1, t2, t3 = zip(*z)
print(t1, t2, t3, sep='\n')  # (1, 2, 3, 4)
                             # (5, 6, 7, 8)
                             # ('P', 'y', 't', 'h')