# найти сумму от 1 до 1000
# sum = 0
# i = 1
# N = 1000
# условия можно устанавливать любые, как и все условные операторы
# while i <= 1000 and i <= 50:
#     sum += i
#     i += 1
# print(sum)
# # как посчитать вот это условие [1, 3, 5, 7] через один
# while i <= 1000 and i <= 50:
#     sum += i
#     i += 2
# print(sum)
# 2, -4, 8, -16 .....n
# n = -10
# i = -1
# while i >= n:
#     i *= -2
#     print(i, end=' ') # 2 -4 8 -16
# -1,-2,-3,-4......n
# while i >= n:
#     i -= 1
#     print(i, end=' ') # -2 -3 -4 -5 -6 -7 -8 -9 -10 -11
# проверим пароль пользователя
# pass_true = 'password'
# ps = ''
#
# while ps != pass_true:
#     ps = input('Введите пароль - ')
#
# print('Добро пожаловать в систему секретных данных - ')
# выведим числа кратные трём
n = 20
i = 1
lst = []
while i <= n:
    if i % 3 == 0:
        lst.append(i)
    i += 1
print(lst)