# Срезы списков
lst = ['Москва', 'Уфа', 'Тверь', 'Казань']
print(lst[1:3])
# срез совершенно независим от основного списка
a = lst[1:3]
a[0] = 'Воронеж'
print(a) # ['Воронеж', 'Тверь']
print(lst) # ['Москва', 'Уфа', 'Тверь', 'Казань']
print(lst[:3]) # ['Москва', 'Уфа', 'Тверь']
# делаем копию списка
cities = lst[:]
print(cities) # ['Москва', 'Уфа', 'Тверь', 'Казань']
# разные айдишники, значит мы зделали копию lst
print(id(cities)) # 2195334790464
print(id(lst)) # 2195334447360
marks = [1, 2, 3, 4, 3, 5, 2]
print(marks[2:-1]) # [3, 4, 3, 5]
print(marks[-3:-1]) # [3, 5]
print(marks[1:6:2]) # [2, 4, 5]
print(marks[:6:2]) # [1, 3, 3]
print(marks[1::2]) # [2, 4, 5]
print(marks[::2]) # [1, 3, 3, 2]
# через срезы мы можем присваивать новые элементы списка
marks[3:5] = ['хорошо', 'удовлетворительно']
print(marks) # [1, 2, 3, 'хорошо', 'удовлетворительно', 5, 2]
marks[::2] = [0,0,0,0]
print(marks) # [0, 2, 0, 'хорошо', 0, 5, 0]
marks[2:4] = 10, 20 # так тоже можно присваивать
print(marks) # [0, 2, 10, 20, 0, 5, 0]
# сравнение списков
print([1,2,3] == [1,2,3]) # True
print([1,2,3] != [1,2,3]) # False
print([10,2,3] > [1,2,3]) # True
print([1,2,3] >= [1,2,3]) # True
print([1,2,3,4] >= [1,2,3]) # True
print([1,2,3,'abc'] > [1,2,3,'abc']) # False